---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersWarning
source: html/875ef59f-4bc3-e7a3-813a-9975f96c9d67.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersWarning Property

Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyNoExternalParametersWarning { get; }
```